{
  "GATE": {
    "AE": [
      {
        "name": "Engineering Mathematics",
        "topics": [
          {
            "title": "Linear Algebra",
            "details": "Vector algebra, Matrix algebra, systems of linear equations, rank of a matrix, eigen values and eigen vectors."
          },
          {
            "title": "Calculus",
            "details": "Functions of single variable, limits, continuity and differentiability, mean value theorem, chain rule, partial derivatives, maxima and minima, gradient, divergence and curl, directional derivatives. Integration, Line, surface and volume integrals. Theorems of Stokes, Gauss and Green."
          },
          {
            "title": "Differential Equations",
            "details": "First order linear and nonlinear differential equations, higher order linear ODEs with constant coefficients. Partial differential equations and separation of variables methods."
          },
          {
            "title": "Special Topics",
            "details": "Fourier Series, Laplace Transforms, Numerical methods for linear and nonlinear algebraic equations, Numerical integration and differentiation. Complex analysis. Probability and statistics."
          }
        ]
      },
      {
        "name": "Flight Mechanics",
        "topics": [
          {
            "title": "Basics",
            "details": "Atmosphere: Properties, standard atmosphere. Classification of aircraft. Airplane (fixed wing aircraft) configuration and various parts. Pressure altitude; equivalent, calibrated, indicated air speeds; Primary flight instruments: Altimeter, ASI, VSI, Turn-bank indicator. Angle of attack, sideslip; Roll, pitch & yaw controls. Aerodynamic forces and moments."
          },
          {
            "title": "Airplane performance",
            "details": "Drag polar; take-off and landing; steady climb and descent; absolute and service ceiling; range and endurance, load factor, turning flight, V-n diagram. Winds: head, tail and cross winds."
          },
          {
            "title": "Static stability",
            "details": "Stability and control derivatives; longitudinal stick fixed and free stability; horizontal tail position and size; directional stability, vertical tail position and size; lateral stability. Wing dihedral, sweep & position; hinge moments, stick forces."
          },
          {
            "title": "Dynamic stability",
            "details": "Euler angles; Equations of motion; Decoupling of longitudinal and lateral-directional dynamics; longitudinal modes; lateral-directional modes."
          }
        ]
      },
      {
        "name": "Space Dynamics",
        "topics": [
          {
            "title": "Core Topics",
            "details": "Central force motion, determination of trajectory and orbital period in simple cases. Kepler’s laws; escape velocity."
          }
        ]
      },
      {
        "name": "Aerodynamics",
        "topics": [
          {
            "title": "Basic Fluid Mechanics",
            "details": "Conservation laws: Mass, momentum and energy (Integral and differential form); Dimensional analysis and dynamic similarity;"
          },
          {
            "title": "Potential flow theory",
            "details": "sources, sinks, doublets, line vortex and their superposition. Elementary ideas of viscous flows including boundary layers."
          },
          {
            "title": "Airfoils and wings",
            "details": "Airfoil nomenclature; Aerodynamic coefficients: lift, drag and moment; Kutta-Joukoswki theorem; Thin airfoil theory, Kutta condition, starting vortex; Finite wing theory: Induced drag, Prandtl lifting line theory; Critical and drag divergence Mach number."
          },
          {
            "title": "Compressible Flows",
            "details": "Basic concepts of compressibility, One-dimensional compressible flows, Isentropic flows, Fanno flow, Rayleigh flow; Normal and oblique shocks, Prandtl-Meyer flow; Flow through nozzles and diffusers."
          },
          {
            "title": "Wind Tunnel Testing",
            "details": "Measurement and visualization techniques. Shock - boundary layer interaction."
          }
        ]
      },
      {
        "name": "Structures",
        "topics": [
          {
            "title": "Strength of Materials",
            "details": "Stress and strain: Three-dimensional transformations, Mohr’s circle, principal stresses, Three-dimensional Hooke's law, Plane stress and strain. Failure theories: Maximum stress, Tresca von Mises. Strain energy. Castigliano’s principles. Statically determinate and indeterminate trusses and beams. Elastic flexural buckling of columns."
          },
          {
            "title": "Flight vehicle structures",
            "details": "Characteristics of aircraft structures and materials. Torsion, bending and shear of thin-walled sections. Loads on aircraft."
          },
          {
            "title": "Structural Dynamics",
            "details": "Free and forced vibrations of undamped and damped SDOF systems. Free vibrations of undamped 2-DOF systems."
          },
          {
            "title": "Theory of elasticity",
            "details": "Equilibrium and compatibility equations, Airy’s stress function. Vibration of beams."
          }
        ]
      },
      {
        "name": "Propulsion",
        "topics": [
          {
            "title": "Basics",
            "details": "Thermodynamics, boundary layers, heat transfer, combustion and thermo chemistry. Aerothermodynamics of aircraft engines: Thrust, efficiency, range. Brayton cycle."
          },
          {
            "title": "Engine performance",
            "details": "Ramjet, turbojet, turbofan, turboprop and turboshaft engines. After burners."
          },
          {
            "title": "Turbomachinery",
            "details": "Axial compressors: Angular momentum, work and compression, characteristic performance of a single axial compressor stage, efficiency of the compressor and degree of reaction, multi-staging. Centrifugal compressor: Stage dynamics, inducer, impeller and diffuser. Axial turbines: Stage performance."
          },
          {
            "title": "Rockets",
            "details": "Thrust equation and specific impulse, rocket performance. Multi-staging. Chemical rockets. Performance of solid and liquid propellant rockets."
          },
          {
            "title": "Component Aerothermodynamics",
            "details": "Intakes, combustor and nozzle. Turbine blade cooling. Compressor-turbine matching, Surge and stall."
          }
        ]
      }
    ],
    "ME": [
      {
        "name": "Engineering Mathematics",
        "topics": [
          {
            "title": "Linear Algebra",
            "details": "Matrix algebra, systems of linear equations, eigenvalues and eigenvectors."
          },
          {
            "title": "Calculus",
            "details": "Functions of single variable, limit, continuity and differentiability, mean value theorems, indeterminate forms; evaluation of definite and improper integrals; double and triple integrals; partial derivatives, total derivative, Taylor series (in one and two variables), maxima and minima, Fourier series; gradient, divergence and curl, vector identities, directional derivatives, line, surface and volume integrals, applications of Gauss, Stokes and Green’s theorems."
          },
          {
            "title": "Differential equations",
            "details": "First order equations (linear and nonlinear); higher order linear differential equations with constant coefficients; Euler-Cauchy equation; initial and boundary value problems; Laplace transforms; solutions of heat, wave and Laplace's equations."
          },
          {
            "title": "Complex variables",
            "details": "Analytic functions; Cauchy-Riemann equations; Cauchy’s integral theorem and integral formula; Taylor and Laurent series."
          },
          {
            "title": "Probability and Statistics",
            "details": "Definitions of probability, sampling theorems, conditional probability; mean, median, mode and standard deviation; random variables, binomial, Poisson and normal distributions."
          },
          {
            "title": "Numerical Methods",
            "details": "Numerical solutions of linear and non-linear algebraic equations; integration by trapezoidal and Simpson’s rules; single and multi-step methods for differential equations."
          }
        ]
      },
      {
        "name": "Applied Mechanics and Design",
        "topics": [
          {
            "title": "Engineering Mechanics",
            "details": "Free-body diagrams and equilibrium; trusses and frames; virtual work; kinematics and dynamics of particles and of rigid bodies in plane motion; impulse and momentum (linear and angular) and energy formulations, collisions."
          },
          {
            "title": "Mechanics of Materials",
            "details": "Stress and strain, elastic constants, Poisson's ratio; Mohr’s circle for plane stress and plane strain; thin cylinders; shear force and bending moment diagrams; bending and shear stresses; deflection of beams; torsion of circular shafts; Euler’s theory of columns; energy methods; thermal stresses; strain gauges and rosettes; testing of materials with universal testing machine; testing of hardness and impact strength."
          },
          {
            "title": "Theory of Machines",
            "details": "Displacement, velocity and acceleration analysis of plane mechanisms; dynamic analysis of linkages; cams; gears and gear trains; flywheels and governors; balancing of reciprocating and rotating masses; gyroscope."
          },
          {
            "title": "Vibrations",
            "details": "Free and forced vibration of single degree of freedom systems, effect of damping; vibration isolation; resonance; critical speeds of shafts."
          },
          {
            "title": "Machine Design",
            "details": "Design for static and dynamic loading; failure theories; fatigue strength and the S-N diagram; principles of the design of machine elements such as bolted, riveted and welded joints; shafts, gears, rolling and sliding contact bearings, brakes and clutches, springs."
          }
        ]
      },
      {
        "name": "Fluid Mechanics and Thermal Sciences",
        "topics": [
          {
            "title": "Fluid Mechanics",
            "details": "Fluid properties; fluid statics, manometry, buoyancy, forces on submerged bodies, stability of floating bodies; control-volume analysis of mass, momentum and energy; fluid acceleration; differential equations of continuity and momentum; Bernoulli’s equation; dimensional analysis; viscous flow of incompressible fluids, boundary layer, elementary turbulent flow, flow through pipes, head losses in pipes, bends and fittings."
          },
          {
            "title": "Heat-Transfer",
            "details": "Modes of heat transfer; one dimensional heat conduction, resistance concept and electrical analogy, heat transfer through fins; unsteady heat conduction, lumped parameter system, Heisler's charts; thermal boundary layer, dimensionless parameters in free and forced convective heat transfer, heat transfer correlations for flow over flat plates and through pipes, effect of turbulence; heat exchanger performance, LMTD and NTU methods; radiative heat transfer, Stefan-Boltzmann law, Wien's displacement law, black and grey surfaces, view factors, radiation network analysis."
          },
          {
            "title": "Thermodynamics",
            "details": "Thermodynamic systems and processes; properties of pure substances, behavior of ideal and real gases; zeroth and first laws of thermodynamics, calculation of work and heat in various processes; second law of thermodynamics; thermodynamic property relations and charts; equation of state, phase equilibrium; availability and irreversibility; Clausius inequality."
          },
          {
            "title": "Applications",
            "details": "Power Engineering: Air and gas compressors; vapour and gas power cycles, concepts of regeneration and reheat. I.C. Engines: Air-standard Otto, Diesel and dual cycles. Refrigeration and air-conditioning: Vapour and gas refrigeration and heat pump cycles; properties of moist air, psychrometric chart, basic psychrometric processes. Turbomachinery: Impulse and reaction principles, velocity diagrams, Pelton-wheel, Francis and Kaplan turbines, steam and gas turbines."
          }
        ]
      },
      {
        "name": "Materials, Manufacturing and Industrial Engineering",
        "topics": [
          {
            "title": "Engineering Materials",
            "details": "Structure and properties of engineering materials, phase diagrams, heat treatment, stress-strain diagrams for engineering materials."
          },
          {
            "title": "Casting, Forming and Joining Processes",
            "details": "Different casting processes, design of patterns, moulds and cores; solidification and cooling; riser and gating design. Plastic deformation and yield criteria; fundamentals of hot and cold working processes; load estimation for bulk (forging, rolling, extrusion, drawing) and sheet (shearing, deep drawing, bending) metal forming processes; principles of powder metallurgy. Principles of welding, brazing, soldering and adhesive bonding."
          },
          {
            "title": "Machining and Machine Tool Operations",
            "details": "Mechanics of machining; basic machine tools; single and multi-point cutting tools, tool geometry and materials, tool life and wear; economics of machining; principles of non-traditional machining processes; principles of work holding, design of jigs and fixtures."
          },
          {
            "title": "Metrology and Inspection",
            "details": "Limits, fits and tolerances; linear and angular measurements; comparators; gauge design; interferometry; form and finish measurement; alignment and testing methods; tolerance analysis in manufacturing and assembly."
          },
          {
            "title": "Computer Integrated Manufacturing",
            "details": "Basic concepts of CAD/CAM and their integration tools."
          },
          {
            "title": "Production Planning and Control",
            "details": "Forecasting models, aggregate production planning, scheduling, materials requirement planning."
          },
          {
            "title": "Inventory Control",
            "details": "Deterministic models; safety stock inventory control systems."
          },
          {
            "title": "Operations Research",
            "details": "Linear programming, simplex method, transportation, assignment, network flow models, simple queuing models, PERT and CPM."
          }
        ]
      }
    ]
  },
  "ISRO": {
    "Technical Assistant (CSE)": [
      {
        "name": "General English",
        "topics": [
          {
            "title": "Verbal Ability",
            "details": "Comprehension, Grammar, Vocabulary, Sentence Transformation."
          }
        ]
      },
      {
        "name": "Arithmetic & Reasoning",
        "topics": [
          {
            "title": "Quantitative Aptitude",
            "details": "Numbers, Percentages, Time & Work, Data Interpretation."
          }
        ]
      },
      {
        "name": "Computer Science (Core)",
        "topics": [
          {
            "title": "Discrete Mathematics",
            "details": "Number Systems, Logic, Sets, Relations, Functions."
          },
          {
            "title": "Digital Logic",
            "details": "Boolean Algebra, Combinational & Sequential Circuits."
          },
          {
            "title": "Computer Organization",
            "details": "Architecture, Memory Organization, I/O Interface."
          },
          {
            "title": "Programming & Data Structures",
            "details": "C/C++, Arrays, Stacks, Queues, Linked Lists, Trees."
          },
          {
            "title": "Algorithms",
            "details": "Analysis, Sorting, Searching, Graph Algorithms."
          },
          {
            "title": "Operating Systems",
            "details": "Process Management, Scheduling, Deadlocks, Memory Management."
          },
          {
            "title": "Databases",
            "details": "ER Models, Relational Model, SQL, Normalization."
          },
          {
            "title": "Computer Networks",
            "details": "OSI Model, TCP/IP, Switching, Routing, Protocols."
          },
          {
            "title": "Microprocessors",
            "details": "Microprocessors & Embedded Systems."
          },
          {
            "title": "Web Technologies",
            "details": "HTML, CSS, JavaScript, Software Engineering Basics."
          }
        ]
      }
    ],
    "AE": [
      {
        "name": "Aerodynamics",
        "topics": [
          {
            "title": "Fluid Mechanics",
            "details": "Basics of fluid mechanics, potential flow, boundary layers."
          },
          {
            "title": "High Speed Aerodynamics",
            "details": "Shock waves, expansion fans, nozzle flows."
          }
        ]
      },
      {
        "name": "Propulsion",
        "topics": [
          {
            "title": "Rocket Propulsion",
            "details": "Solid and liquid propulsion systems, performance parameters."
          },
          {
            "title": "Jet Propulsion",
            "details": "Gas turbine engines, intakes, nozzles."
          }
        ]
      },
      {
        "name": "Structures",
        "topics": [
          {
            "title": "Structural Analysis",
            "details": "Stress, strain, bending, torsion, buckling."
          },
          {
            "title": "Spacecraft Structures",
            "details": "Launch loads, vibration, thermal stresses."
          }
        ]
      }
    ],
    "ME": [
      {
        "name": "Thermal Engineering",
        "topics": [
          {
            "title": "Heat Transfer",
            "details": "Conduction, convection, radiation, heat exchangers."
          },
          {
            "title": "Thermodynamics",
            "details": "Laws of thermodynamics, cycles, properties of gases."
          }
        ]
      },
      {
        "name": "Design & Mechanics",
        "topics": [
          {
            "title": "Machine Design",
            "details": "Gears, bearings, shafts, joints."
          },
          {
            "title": "Mechanics",
            "details": "Statics, dynamics, strength of materials."
          }
        ]
      }
    ]
  },
  "SEBI": {
    "Grade A (IT)": [
      {
        "name": "Phase 1 - Paper 1 (Common)",
        "topics": [
          {
            "title": "General Awareness",
            "details": "Current Affairs, Financial Sector Awareness."
          },
          {
            "title": "English Language",
            "details": "Grammar, Comprehension, Vocabulary."
          },
          {
            "title": "Quant & Reasoning",
            "details": "Quantitative Aptitude, Logical Reasoning."
          }
        ]
      },
      {
        "name": "Phase 1 - Paper 2 (IT Stream)",
        "topics": [
          {
            "title": "Database Concepts",
            "details": "ER Model, Relational Model, SQL, Normalization, Indexing."
          },
          {
            "title": "SQL Programming",
            "details": "Queries, Joins, Aggregates, Subqueries."
          },
          {
            "title": "Programming Concepts",
            "details": "C/C++/Java/Python basics, OOPs concepts."
          },
          {
            "title": "Algorithms & Data Structures",
            "details": "Arrays, Lists, Stacks, Queues, Trees, Sorting, Searching."
          },
          {
            "title": "Networking",
            "details": "OSI Model, TCP/IP, IP Addressing, Protocols, Security."
          }
        ]
      },
      {
        "name": "Phase 2 - Paper 1 (IT Stream)",
        "topics": [
          {
            "title": "Coding Test",
            "details": "Programming problems in Java/C++/Python."
          }
        ]
      },
      {
        "name": "Phase 2 - Paper 2 (Common)",
        "topics": [
          {
            "title": "English Writing",
            "details": "Essay, Précis, Comprehension."
          }
        ]
      }
    ]
  }
}